#include<iostream>

using namespace std;

int main() 
{
	setlocale(LC_ALL, "Russian");

	const unsigned m = 11;

	int A[m][m] = {
		{11,5,0,5,5,1,0,11,0,5,11},
		{5,1,11,5,5,0,1,1,5,1,0},
		{0,1,5,0,0,5,11,1,5,5,0},
		{11,1,5,11,1,11,0,0,11,11,1},
		{1,11,0,0,5,11,11,0,1,1,5},
		{5,5,11,0,1,0,0,1,5,1,1},
		{11,0,1,1,1,5,1,1,5,11,1},
		{11,5,11,11,0,5,0,1,0,0,11},
		{0,5,11,11,1,11,5,5,11,0,1},
		{1,1,1,1,11,1,1,0,1,0,1},
		{11,5,0,5,0,0,0,1,11,1,5}
	};

	int count = 0;

	for (int i = 0; i < m; i++)
	{
		for (int j = 0; j < m; j++)
		{

			if (A[i][j] != A[i + 1][j] && A[i][j] != A[i][j + 1] && A[i][j] != A[i + 1][j + 1])
			{
				count++;
			}
		}
	}
	cout <<"Кол-во четверок, в каждой из которых все элементы различны = "<< count << endl;

	return 0;
}
